app/Controllers/Cardapio.php

SELECT *
FROM `cardapios`
---
    public function index()
    {
        $cardapios = $this->cardapioModel->findAll();

SELECT *
FROM `cardapios`
---
    public function cardapio()
    {
        $cardapios = $this->cardapioModel->findAll();

SELECT *
FROM `cardapios`
WHERE `cardapios`.`id` = '7'
---
    public function editJanta($id)
    {
        $cardapio = $this->cardapioModel->find($id);

UPDATE `cardapios` SET `updated_at` = '2025-07-25 13:50:02'
WHERE `cardapios`.`id` IN ('1')
---
    public function updateAlmoco($id)
    {
        $itens = $this->request->getPost('itens');
        $tipo = 0; // almoço

        $this->itemModel->where('cardapio_id', $id)->where('tipo', $tipo)->delete();

        if (!empty($itens)) {
            foreach ($itens as $item) {
                if (!empty(trim($item))) {
                    $this->itemModel->insert([
                        'cardapio_id' => $id,
                        'nome' => $item,
                        'tipo' => $tipo,
                    ]);
                }
            }
        }

        $this->cardapioModel->update($id, ['updated_at' => date('Y-m-d H:i:s')]);

UPDATE `cardapios` SET `updated_at` = '2025-07-25 13:50:21'
WHERE `cardapios`.`id` IN ('7')
---
    public function updateJanta($id)
    {
        $itens = $this->request->getPost('itens');
        $tipo = 1; // janta

        $this->itemModel->where('cardapio_id', $id)->where('tipo', $tipo)->delete();

        // dd([
        //     'cardapio_id' => $id,
        //     'itens' => $itens,
        //     'tipo' => $tipo
        // ]);

        if (!empty($itens)) {
            foreach ($itens as $item) {
                if (!empty(trim($item))) {
                    $this->itemModel->insert([
                        'cardapio_id' => $id,
                        'nome' => $item,
                        'tipo' => $tipo,
                    ]);
                }
            }
        }

        $this->cardapioModel->update($id, ['updated_at' => date('Y-m-d H:i:s')]);